-- =============================================================
-- ТЕМА: Основы SQL — SELECT, DISTINCT, LIMIT
-- =============================================================


-- -------------------------------------------------------------
-- Задача 1 | Уровень: Базовый | Тема: SELECT
-- Вывести все столбцы и строки таблицы products.
-- -------------------------------------------------------------

SELECT *
FROM products;


-- -------------------------------------------------------------
-- Задача 2 | Уровень: Базовый | Тема: LIMIT
-- Вывести все столбцы таблицы order_items, ограничив результат 3 строками.
-- Поля: order_id, order_item_id, price, product_id
-- -------------------------------------------------------------

SELECT *
FROM order_items
LIMIT 3;


-- -------------------------------------------------------------
-- Задача 3 | Уровень: Базовый | Тема: DISTINCT
-- Вывести список уникальных городов, в которых зарегистрированы пользователи.
-- Поля: customer_city
-- -------------------------------------------------------------

SELECT DISTINCT customer_city
FROM customers;
